loadstring( exports.interfacer:extend( "Interfacer" ) )( )

SHOP_ITEMS = {
	office = {
		{
			id = 1;
			name = "Скромная коморка";
			cost = 750000;
			tooltip_text = "Открывает доступ к секретарше";
		},
		{
			id = 2;
			name = "Солидный офис";
			cost = 1000000;
			tooltip_text = "Открывает доступ к секретарше";
		},
		{
			id = 3;
			name = "Дворец миллиардера";
			cost = 1500000;
			tooltip_text = "Открывает доступ к секретарше и возможность купить 3-ий бизнес";
		},
	},

	secretary = {
		{
			id = 1;
			name = "Строгий секретарь";
			cost = 75000;
		},
		{
			id = 2;
			name = "Молодая болтушка";
			cost = 50000;
		},
		{
			id = 3;
			name = "Милая девушка";
			cost = 100000;
		},
		{
			id = 4;
			name = "Бывшая учительница";
			cost = 130000;
		},
	},

	skins = {
		{
			id = 71;
			name = "Солидный господин";
			cost = 100000;
		},
		{
			id = 312;
			name = "Молодой миллионер";
			cost = 150000;
		},
		{
			id = 95;
			name = "Брутальный хозяин жизни";
			cost = 250000;
		},
	},
}