local RULES_TEXT = [[
1. ОБЩИЕ ПОЛОЖЕНИЯ
1.1 NEXTRP — это ролевой проект, действия которого происходят в российском городе

1.2 Любые отношения на NEXTRP выстраиваются исходя из взаимного уважения

1.3 Каждый игрок, зарегистрированный на проекте, с момента регистрации считается ознакомленным со всеми правилами и несет ответственность за их несоблюдение

1.4 Правила действуют на всех игроков, независимо от их игрового статуса на проекте

1.5 При изменении правил, будет оповещение в официальных источниках проекта

1.6 Игровая администрация NEXTRP действует в рамках правил проекта

1.7 Аффилированные учетные записи — учетные записи связанные по одному или нескольким признаками

1.8 Конечный продукт NEXTRP — создание максимально-комфортного игрового процесса, доступного каждому пользователю

1.9 Нарушение — совершение пользователем действия, запрещенного правилами проекта. Влечет за собой применение наказания к учетной записи пользователя

1.10 Повторное нарушение — намеренное нарушение правил проекта, совершенное после применения наказания за аналогичное нарушение

1.11 Наказание — действие по ограничению или прекращению доступа пользователя к проекту NEXTRP или к отдельным его элементам со стороны администрации проекта

2. УЧЕТНЫЕ ЗАПИСИ ПОЛЬЗОВАТЕЛЕЙ
2.1 Учетные записи пользователей — созданные конечным пользователем аккаунты для доступа к сервису NEXTRP

2.1.1 Зарегистрированные на NEXTRP учетные записи, являются интеллектуальной собственностью компании

2.1.2 NEXTRP сохраняет за собой исключительные права на все учетные записи пользователей

2.2 Политика NEXTRP по отношению к учетным записям пользователей

2.2.1 Администрация и сотрудники NEXTRP никогда не станут запрашивать ваши личные данные, в том числе логины, пароли и прочую информацию об аккаунте. Остерегайтесь мошенников!

2.2.2 Администрация не несет ответственности за сохранность игрового имущества, а также имущества, закрепленного за игроками. Никому не передавайте данные от Вашего аккаунта, ни под каким предлогом!

2.2.3 Администрация не занимается восстановлением игрового имущества, в случае взлома или передачи вашей учетной записи третьим лицам. Мы бы с радостью помогли вам в таком случае, но практика показала, что есть множество ребят, которые злоупотребляли отсутствием этого правила!

2.2.4 Запрещена покупка / продажа (попытка продажи) учетных записей NEXTRP

Наказание: 

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей (как для покупателя, так и для продавца) 

2.2.5 Пользователям запрещена покупка / продажа игрового имущества и должностей за реальные деньги (намеренная передача игровой валюты через казино, продажу автомобилей, бизнесов, недвижимости и всего прочего — аналогично будет считаться нарушением и попадать под данный пункт правил) 

Наказание: 

• Постоянная блокировка действия учетной записи на всех серверах, а также всех аффилированных учетных записей (как для продавца, так и для покупателя) 

2.2.6 Запрещена намеренная передача учетной записи третьим лицам

Наказание:

• Временная приостановка действия учетной записи на срок до 7 дней

Наказание при повторном нарушении:

• Повторная приостановка действия учетной записи на срок до 30 дней

2.2.7 Запрещено создание и использование более 3-х учетных записей на одном устройстве

Наказание:

• Постоянная блокировка всех учетных записей, которые были зарегистрированы после первых 3-х

2.3 Получение несанкционированного доступа к чужой учетной записи

Запрещены любые действия, совершенные как на игровом сервере, так и вне его, направленные на получение несанкционированного доступа к учетной записи, зарегистрированной другим игроком проекта

Наказание:

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей

3. ИГРОВЫЕ НИКИ
3.1 Ники игроков должны иметь следующий формат: "Имя Фамилия"
Примеры: Алексей Шукшин, Елена Кутузова, Николай Иванов

3.2 Запрещено использовать ники не являющиеся именем и фамилией
Примеры: Пруф Кеков, Баттхерт Мемный, Натаха Двеусловки

Наказание:

• Принудительная смена никнейм по выбору пользователя

3.3 Запрещено использовать оскорбительные и нецензурные ники

Наказание:

• Принудительная смена имени персонажа 

4. RP-РЕЖИМ
4.1 Игровой процесс на сервере Московский неотъемлемо связан с ролевой игрой. Обязательным условием для игрового процесса является чёткое и строгое соблюдение всех правил RP-режима!

4.2 OOC (Вне персонажа, Out of character) — взаимодействие с другими игроками, происходящее независимо от ролевого процесса, через внешние площадки NEXTRP, специальные игровые чаты или иные способы связи

4.3 IC (В режиме ролевой игры, In character) — взаимодействие с другими игроками или игровым миром, происходящее непосредственно во время ролевого процесса

4.4 MG (метагейминг) — использование внеигровой информации (информации из реальной жизни) во время игрового процесса, находясь в игре

Для полного погружения в реальность происходящего, в игре запрещено упоминать информацию из реальной жизни!

Наказание:

• Блокировка текстового и голосового чата на срок от 120 до 300 минут

Наказание при повторном нарушении (если с момента первого, до повторного нарушения прошло менее 24 часов)

Временная приостановка действия учетной записи сроком на 3 дня

4.5 DM (ДесМатч, Deathmatch) — убийство или нанесение урона персонажу другого игрока при условии отсутствия весомой на то причины (причиной на то, может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни) 

Наказание:

• Перемещение персонажа в КПЗ на срок от 100 до 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.6 DB (ДрайвБай) — убийство или нанесение урона персонажу другого игрока, находясь на водительском месте транспортного средства, при условии отсутствия весомой на то причины (причиной может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни) 

Наказание:

• Перемещение персонажа в КПЗ на срок от 120 до 180 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.7 DM auto (AutoDeathmatch) — уничтожение или нанесение урона любому транспортному средству при условии отсутствия весомой на то причины (причиной на то, может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни) 

Наказание:

• Перемещение персонажа в КПЗ на срок от 120 до 180 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.8 Bunny hopping (БХ)

Запрещен бег с прыжками для более быстрого передвижения персонажа с целью получения преимущества в момент погони (запрещено как для преследователя, так и для преследуемого)
Наказание:

• Перемещение персонажа в КПЗ сроком на 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.9 Revenge Kill (РК)

Запрещено возвращаться на место смерти в течении 10 минут и/или возвращаться с целью мести игроку, который убил вас накануне. РП-ситуация считается исчерпаной после смерти персонажа! 
Правило относимся также и для фракций – запрещено сталкерить игроков, посещениями больницы после убийства для дальнейшего задержания!

Наказание:

• Перемещение персонажа в КПЗ сроком на 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.10 Повреждение чужого транспортного средства путем неоднократного столкновения, равно как и умышленное создание ДТП

Наказание:

• Перемещение персонажа в КПЗ на срок в 180 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 5 дней

4.11 PG (ПауэрГейминг, Powergaming) — превышение физических возможностей персонажа и проявления отсутствия инстинкта самосохранения!
Примеры: ездить на крыше транспортного средства, нападать с кулаками на вооруженного персонажа, нападать в одиночку на толпу

Наказание:

• Перемещение персонажа в КПЗ на срок в 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.12 SK (Спавн Килл, Убийство на респауне, Spawn Kill) — убийство персонажа других игроков в точках респауна

Наказание:

• Перемещение персонажа в КПЗ на срок в 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.13 NRP (НонРП, не ролевое поведение) — нарушение логики действий персонажа, также не реалистичное поведение персонажа, либо создание не реалистичных ситуаций персонажем. 
Пример: персонаж упал со скалы и при этом остался жив, а игрок спокойно встал и побежал далее, как ни в чём не бывало (без каких-либо отыгровок РП)

Наказание:

• Перемещение персонажа в КПЗ на срок в 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 5 дней

4.14 Читы — использование стороннего программного обеспечения, модификаций, хаков, CLEO-скриптов, инъекций в внутриигровой движок игры и т.д., с целью получения преимущества над другими игроками и/или создания помех

Наказание:

• Перманентная блокировка учетной записи, а также всех аффилированных учетных записей

4.15 Создание помех для ролевого процесса — вмешательство в ролевой процесс других игроков, совершенный вне IC-режима или с нарушением правил проекта. 
Пример: когда вы забегаете в здание больницы, флудите в голосовой чат и мешаете работе медиков – это является нарушением данного пункта правил!

Наказание:

• Перемещение персонажа в КПЗ на срок в 180 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 5 дней

4.16 Помеха комфортной игре

Запрещено вмешательство в игровой процесс и РП-ситуации, которые не имеют отношения к вашему персонажу (как в режиме ООС, так и в режиме IC).
Пример: два игрока проводят сделку по продаже транспорта на Б/У рынке, а вы начинаете ездить вокруг них, провоцировать и осуществлять всяческие помехи.

Наказание:

• Перемещение персонажа в КПЗ на срок в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 5 дней

4.17 Абьюз — использование любых ошибок, уязвимостей, неучтенных возможностей игрового мода, с целью получения преимущества над другими игроками и/или создания помех.

Наказание:

• Временная приостановка действия учетной записи на срок до 3 дней + удаление игрового имущества, полученного с нарушением данного пункта правил

В случае грубых нарушений, которые наносят вред и ущерб продукту NEXTRP: постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей 

4.18 Срыв мероприятия — вмешательство в проводимое администрацией или согласованное игроками проекта с администрацией, мероприятие, с целью создания помех РП процессу

Наказание:

• Временная приостановка действия учетной записи сроком на 3 дня

4.19 Запрещено стоять AFK более 5 минут

Наказание:

• Отключение игрока от сервера

Если игрок находится AFK в месте, где создает помеху для других игроков: администрация вправе переместить игрока в другую локацию, где игрок не создает помеху для других

4.20 IC и  OOC Обман игроков

Запрещен IC обман

Выход из игры во время IC обмена приравнивается к OOC обману

Все сделки, оговоренные двумя сторонами должны быть выполнены обоюдно, при отсутствии выполнения условий со стороны игрока сделка приравнивается к IC обману

Запрещен OOC обман

Покупка/Продажа имущества происходит исключительно с помощью функционала сервера. Обход приравнивается к OOC обману

Все договоренности в чатах игры и личных сообщениях дискорда приравниваются к OOC обману

Примечание: Для доказательств OOC обмана, Вы обязательно должны иметь видеозапись с диалогом

Наказание:

• Удаление игрового имущества, полученного с нарушением данного пункта правил + временная приостановка действия учетной записи на срок до 3 дней

Наказание при повторном нарушении:

• Удаление игрового имущества, полученного с нарушением данного пункта правил + временная приостановка действия учетной записи на срок до 7 дней

4.21 Возврат имущества

Администрация проекта NEXTRP не осуществляет возврат имущества, утерянного пользователем, вследствие неисполнения условий внутриигровой сделки. Данное положение распространяется на всех участников сделки. Старайтесь взвесить все за и против непосредственно перед любой сделкой!

4.22 Отказ от РП-ситуации

Игрок имеет право отказаться от РП-ситуации только в том случае, если его унижают во время РП процесса. Все остальные отказы от РП-ситуаций считаются нарушением!
Пример нарушения: намеренный выход из игры, либо использование команды /respawn в момент полицейской погони и/или задержания! Вы можете выйти из игры после успешного завершения погони, но никак не в процессе! 

Наказание: 

• Перемещение персонажа в КПЗ сроком в 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

4.23 Создание токсичной обстановки

Запрещены регулярные провокации, троллинг, создание чувства преследования, угрозы и шантаж! (Регулярные = 3 и более зафиксированных ситуации за 3 календарных дня)

Наказание:

• Временная приостановка действия учетной записи сроком на 30 дней

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей

4.24 Систематические нарушения правил RP-режима (5 и более нарушений от игрока в течении 7 календарных дней)

Наказание: 

• Временная приостановка действия учетной записи сроком на 30 дней

5. ЧАТЫ И КАНАЛЫ ОБРАТНОЙ СВЯЗИ
5.1 Оскорбления

Запрещены любые оскорбления игроков в OOC-чат и злоупотребление оскорблениями, неуместными в текущей ролевой ситуации в IC-чат

Наказание:

• Блокировка текстового и голосового чата на срок от 60 до 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Блокировка текстового и голосового чата на 24 часа

5.2 Упоминание родных

Запрещены любые упоминания и оскорбления родных, как прямым текстом, так и завуалированно

Наказание:

• Блокировка текстового и голосового чата на срок от 300 минут до 24 часов

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 30 дней):

• Временная приостановка действия учетной записи сроком на 30 дней

5.3 Запрещены любые оскорбления нации, религии и/или разжигания межнационального конфликта

Наказание:

• Временная приостановка действия учетной записи сроком на 30 дней

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 30 дней):

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей

5.4 Запрещено осуществлять любую рекламу сайтов, а также сторонних проектов (как прямо, так и завуалировано)

Наказание:

• Временная приостановка действия учетной записи сроком на 30 дней

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 7 дней):

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей

5.5 Запрещено повторять сообщения более двух раз, а также писать сообщения, лишенные смысловой нагрузки

Наказание: 

• Блокировка текстового и голосового чата на срок в 30 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 7 дней):

• Блокировка текстового и голосового чата на срок от 60 до 120 минут

5.6 Запрещено использовать нецензурные выражения при обращении в репорт к администрации.

Наказание:

• Предупреждение от администрации (администратор сообщает игроку, что так делать не стоит)

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 7 дней):

• Блокировка текстового и голосового чата на срок в 120 минут

5.7 Отыгрывание РП в свою пользу

Запрещены любые отыгровки РП в одностороннем порядке и/или дающие преимущество одной стороне!
Пример: “/me протянул руку в карман человеку напротив” → “/do В кармане обнаружены наркотики” ; 
”/try нашёл оружие в сумке гражданина”

Наказание:

• Блокировка текстового и голосового чата на срок в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 7 дней):

• Блокировка текстового и голосового чата на 24 часа

5.8 Оскорбительные отыгровки РП

Запрещены любые отыгровки, которые оскорбляют других игроков!

Например: “/try посадить на бутылку человека напротив”

Наказание:

• Блокировка текстового и голосового чата на срок от 60 до 120 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Блокировка текстового и голосового чата на 24 часа

6. ПДД (Правила дорожного движения)
6.1 Запрещено игнорирование ДТП. Любое ДТП считается за отдельную РП-ситуацию, которую обязаны отыграть все участники. 
Исключение: игроки имеют право пропустить полную отыгровку ДТП при обоюдном согласии собеих сторон. В таком случае, всем участникам достаточно отыграть: “/do Ремни безопасности пристегнуты, автомобиль не пострадал”

Наказание: 

• Перемещение персонажа в КПЗ сроком в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 24 часов):

• Временная приостановка действия учетной записи сроком на 3 дня

6.2 Запрещена езда по полям и тротуарам

Исключения:

Езда по полю на внедорожнике с включенным круиз-контролем

Езда по полю, с целью посещения хобби “Рыбалка” либо “Искатель сокровищ” с включенным круиз-контролем (администратор в праве выдать наказание вне зависимости от аргументов игрока, если нарушение обнаружено в дальней локации от места положения хобби) 

Примечание: в случае “вылета” за пределы трассы в следствии ДТП , игрок обязан отыграть РП ситуацию и самым ближайшим маршрутом вернуться на проезжую часть. Дальнейшая езда за пределами трассы возможна только с целью возврата на проезжую часть. Любая езда за пределами проезжей части возможна только с использованием круиз-контроля!

Наказание:

• Перемещение персонажа в КПЗ на срок в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Перемещение персонажа в КПЗ на срок в 120 минут и лишение игрока водительских прав с отправкой на пересдачу

6.3 Запрещена парковка транспортных средств вне территории проезжей части и/или в местах не предусмотренных для парковки
Исключения:

Можно припарковать транспорт на обочине проезжей части у бардюра, если парковку не запрещают соответствующие знаки дорожного движения и/или когда транспорт не осуществляет помеху для других игроков 

Можно припарковать транспорт находясь рядом с зоной “Хобби”, при условии, что в окрестностях не предусмотрено парковки (транспорт не должен осуществлять помеху для других игроков)

Наказание:

• Перемещение персонажа в КПЗ на срок в 30 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Перемещение персонажа в КПЗ на срок в 120 минут и лишение игрока водительских прав с отправкой на пересдачу

6.4 Запрещена парковка транспорта с целью осуществления помех для игрового процесса 
Например: помеха презду другого транспорта либо помеха для взаимодействия других игроков

Наказание:

• Перемещение персонажа в КПЗ на срок в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Временная приостановка действия учетной записи сроком на 3 дня

6.5 Умышленное создание ДТП

Запрещено намеренно создавать аварийные ситуации и наносить урон (таранить) личным или рабочим транспортом, транспорту другого игрока

Например: умышленно подрезать / таранить фуру дальнобойщика

Исключение: погоня полиции за нарушителем

Перемещение персонажа в КПЗ на срок в 180 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Временная приостановка действия учетной записи на сроком на 7 дней

6.6 Умышленная езда по встречной полосе движения

Запрещено намеренно осуществлять движение по встречной полосе!

В случае потери управления транспортным средством, игрок обязан незамедлительно вернуться на свою полосу движения либо остановить транспорт и включить аварийку – в случае продолжения движения будет выдано наказание!

Наказание:

• Перемещение персонажа в КПЗ на срок в 60 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Перемещение персонажа в КПЗ на срок в 120 минут и лишение игрока водительских прав с отправкой на пересдачу

6.7 Запрещен проезд на красный цвет светофора

Наказание:

• Перемещение персонажа в КПЗ на срок в 30 минут

Наказание при повторном нарушении (если с момента первого, до второго нарушения прошло менее 3-х дней):

• Перемещение персонажа в КПЗ на срок в 120 минут и лишение игрока водительских прав с отправкой на пересдачу

6.8 Запрещена езда без использования указателей поворота (поворотников)

Игрок обязан включать поворотники за 5 секунд до осуществления поворота

Наказание:

• Перемещение персонажа в КПЗ на срок в 15 минут

7. ЗЛОНАМЕРЕННЫЙ ОБМАН
7.1 Выдача себя за представителя NEXTRP

Запрещено сообщать пользователям заведомо-ложную информацию о наличии каких-либо отношений с NEXTRP, равно как и информацию о наличии личных связей с администрацией NEXTRP

Наказание:

• Перманентная блокировка всех учетных записей пользователя

7.1.1 Выдача себя за представителя NEXTRP, совершенная с целью получения доступа к чужой учетной записи запрещена.

Наказание:

• Перманентная блокировка всех учетных записей пользователя

7.1.2 Выдача себя за представителя NEXTRP, совершенная с целью завладения игрового имущества других пользователей

Наказание: 

• Перманентная блокировка всех учетных записей пользователя

7.1.3 Запрещена выдача себя за представителя NEXTRP, либо за его родственника, совершенная с целью создания токсичной атмосферы

Наказание:

• Временная приостановка действия учетной записи на срок до 3 дней

Наказание при повторном нарушении:

• Временная приостановка действия учетной записи на срок до 7 дней

7.2 Злоупотребление каналами обратной связи

Запрещена передача заведомо-ложной информации администрации проекта с целью получения преимущества над другими игроками, или применения наказания к учетной записи другого игрока, засорение каналов обратной связи ненужной информацией, которая не является проблемой/вопросом по игре (Пример: "Привет, как дела?")

Наказание:

• Блокировка текстового и голосового чата на срок от 5 минут до 15 минут

8. ГРУБЫЕ НАРУШЕНИЯ
8.1 Грубые нарушения — действия пользователей, направленные на причинение ущерба продукту NEXTRP, а также направленные на саботаж деятельности администрации NEXTRP

8.2 Администрация NEXTRP применяет иные наказания к пользователям, совершившим грубое нарушение, вне зависимости от наличия или отсутствия умысла

8.3 Злоупотребление правилами — использование не указанных в правилах элементов взаимодействия с игровым миром или другими пользователями, с целью получения значительного преимущества над другими игроками, или создания значительных помех ролевому процессу

Наказание:

• Временная приостановка действия учетной записи на срок до 3 дней

Наказание при повторном нарушении:

• Временная приостановка действия учетной записи на срок до 7 дней

8.4 Ущерб серверам — любое действие или бездействие, направленное на нанесение значительного вреда экономике игровой валюты или стабильности работы сервера или проекта в целом

Наказание:

• Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей

9. ПЕРЕСМОТР НАКАЗАНИЙ
9.1 Каждый пользователь, считающий, что наказание выданное администрацией игровых серверов несправедливо, имеет возможность оспорить его при помощи сервисов технической поддержки NEXTRP:

support@nextrp.ru

9.2 Каждый пользователь, который обнаружил баг / ошибку игры, обязан сообщить о ней в сервисы технической поддержки:

support@nextrp.ru

9.3 Каждый пользователь, сообщивший первым о критических багах / абьюзах / ошибках игрового мода, которые потенциально могут нанести ущерб продукту NEXTRP — получает награду в виде игровой валюты на сервере, где играет (нашел критический баг - сообщил в поддержку - получил награду)
]]

function GetRoleplayRules( )
    return RULES_TEXT
end

local UI = { }

function ShowInviteRulesUI( state, onAccept )
    if state then
        ShowInviteRulesUI( false )

        UI = { }

        UI.black_bg = ibCreateBackground( 0, _, true ):ibData( "priority", 100 ):ibData( "alpha", 0 ):ibAlphaTo( 255, 300 )
        UI.bg = ibCreateImage( 0, 0, 0, 0, "img/rules/bg.png", UI.black_bg ):ibSetRealSize( ):center( )

        local items = { }
        local fake_title = "\n0. END\n"
        for text, next_title in utf8.gmatch( "\n" .. RULES_TEXT .. fake_title, "(.-)(\n[0-9]%. [%w%p ]+\n)" ) do
            if #items > 0 then
                items[ #items ].subitems = split( text, "\n\n" )
            end
            if next_title ~= fake_title then
                table.insert( items, {
                    title = next_title:sub( 4 ),
                    subitems = { },
                } )
            end
        end

        UI.rt, UI.sc = ibCreateScrollpane( 0, 80, 1024, 540, UI.bg, { scroll_px = -20 } )
        UI.sc:ibSetStyle( "slim_small_nobg" ):ibBatchData( { sensivity = 100, absolute = true } )
        local py = 0
        for i, item in pairs( items ) do
            local title_bg = ibCreateImage( 0, py - 55, 1024, 191, "img/rules/title_bg.png", UI.rt )
            ibCreateLabel( 50, 0, 0, 0, i, title_bg, 0xFF465c74, _, _, "center", "center", ibFonts.bold_20 ):center_y( )
            ibCreateLabel( 80, 0, 0, 0, item.title, title_bg, _, _, _, "left", "center", ibFonts.bold_16 ):center_y( 1 )

            py = py + 100
            for i, text in pairs( item.subitems ) do
                local text_sx, text_sy, text = dxGetTextSize( text, title_bg:width( ) - 60, 1, ibFonts.regular_14, true )
                ibCreateLabel( 30, py, 0, text_sy, text, UI.rt, _, _, _, "left", "top", ibFonts.regular_14 )
                py = py + text_sy + 11
            end
            py = py + 17
        end
        UI.rt:ibData( "sy", py )
        UI.sc:UpdateScrollbarVisibility( UI.rt )

        local checked = false
        UI.check = ibCreateImage( 37, 663, 16, 13, "img/rules/check.png", UI.bg ):ibData( "alpha", 0 )
        UI.checkbox = ibCreateButton( 30, 655, 30, 30, UI.bg, _, _, _, 0, 0x33ffffff, 0x66AAAAAA )
            :ibData( "color_disabled", ibApplyAlpha( 0xffffffff, 20 ) )
            :ibOnClick( function( key, state )
                if key ~= "left" or state ~= "up" then return end
                ibClick( )
                checked = not checked
                UI.check:ibData( "alpha", checked and 255 or 0 )
                UI.btn_continue:ibData( "disabled", not checked )
            end )

        UI.btn_continue = ibCreateButton( 805, 642, 0, 0, UI.bg, "img/rules/btn_continue.png", "img/rules/btn_continue_h.png", "img/rules/btn_continue_h.png", _, _, 0xFFCCCCCC )
            :ibSetRealSize( )
            :ibData( "disabled", true )
            :ibData( "color_disabled", ibApplyAlpha( 0xffffffff, 20 ) )
            :ibOnClick( function( key, state )
                if key ~= "left" or state ~= "up" then return end
                ibClick( )

                triggerServerEvent( "onPlayerAcceptRules", resourceRoot )
                ShowInviteRulesUI( false )
            end )

        showCursor( true )
    else
        DestroyTableElements( UI )
        UI = nil

        showCursor( false )
    end
end