TOURNAMENT_FIGHTS_TIME = "18:30"
TOURNAMENT_PARTICIPATION_COST = 100000
TOURNAMENT_MAX_PARTICIPANTS = 16

MEMBERSHIP_DATA = 
{
	{ old_cost = 40000,  cost = 5000,  days = 14,  icon = "ticket_blue.png"   },
	{ old_cost = 150000, cost = 30000, days = 60,  icon = "ticket_red.png"    },
	{ old_cost = 600000, cost = 90000, days = 360, icon = "ticket_yellow.png" },
}

FIGHT_CLUB_ENTRANCES = 
{
	{ я },
}

RING_CORNERS = 
{
	[1] = { pos = { -2064.631, 1106.287 - 860, 666.425 }, rot = { 0, 0, 66  }, },
	[2] = { pos = { -2071.436, 1109.073 - 860, 666.425 }, rot = { 0, 0, 255 }, },
}

TOURNAMENT_RULES =
[[
	1. В бою участвует только 2 игрока;
	2. В один день проходит столько
	раундов, сколько готово соперников
	3. Всего один раунд в бою
	4. Длительность раунда не ограничена
	5. Для победы необходимо вырубить противника
	6. Подготовка к турниру начинается с 18:00—18:30
	7. Бои проходят с 18:30 до конца 
	последнего раунда в этот день
	8. Для участия в турнире необходимо
	сделать вклад в 100 000 рублей
]]