REPAIR_COST_MUL = 0.01 -- Полная стоимость ремонта ТС из полностью сломанного состояния( относительно полной стоимости ТС )
FUEL_COST = 57 -- Стоимость литра топлива


WORKSHOPS_LIST = 
{
	-- Аэропорт горки
	{ 
		x = 2396.712, y = -2349.354 + 860, z = 20.236, 
		vehicle_position = Vector3( 2424.425, -1438.330 + 860, 20.260 ),
		vehicle_rotation = 130,
		camera_position = { 2421.46, -1456.05 + 860, 22.85, 2421.63, -1450.07 + 860, 22.75 },
		marker_text = "Обслуживание воздушной техники",
	},

	-- Аэропорт кантри-сайд
	{ 
		x = -2633.488, y = 538.684 + 860, z = 15.24, 
		vehicle_position = Vector3( 2424.425, -1438.330 + 860, 20.260 ),
		vehicle_rotation = 130,
		camera_position = { 2421.46, -1456.05 + 860, 22.85, 2421.63, -1450.07 + 860, 22.75 },
		marker_text = "Обслуживание воздушной техники",
	},
}

PARTS_LIST = 
{
	airplane = { "Левый двигатель", "Правый двигатель", "Фюзеляж", "Левое крыло", "Правое крыло", "Хвост" },
	helicopter = { "Ротор", "Лопасти", "Фюзеляж", "Стёкла", "Хвост", "Шасси" },
	boat = { "Трюм", "Мотор", "Поворотный механизм", "Борт", "Палуба" },
}

function GetLocations( )
    return WORKSHOPS_LIST
end