RULES_LIST = {
    {
        sName = "Руководство для начинающих",
        sIcon = "icon_1",
        pContent = {
            { "Что это за сервер и куда я попал?\n", "NEXT RP — это многопользовательский проект, созданный группой инициативных людей, объединенных любовью к ролевой игре. Основным приоритетом для нас является дружелюбная атмосфера проекте, возможности для отыгрыша своей роли каждым игроком и создание качественной и проработанной атмосферы." },
            { "Что это вообще такое, ролевая игра?\n", "Ролевая игра — это участие в игровом процессе, от лица своего персонажа. Она начинается с создания персонажа. Все персонажи уникальны и создаются игроками." },
            { "А как мне сделать персонажа?\n", "Достаточно зайти на любой сервер и придумать имя и фамилию своему персонажу. Имя должно быть написано на кириллице, обязательно с большой буквы. Мы не против использования иностранных имен, кличек и прозвищ, но не стоит использовать нецензурные выражения, и указывать вместо имени персонажа абракадабру или бессмыслицу." },
            { "С чего мне начать?\n", "Знакомство можно начать посмотрев доступные новичкам работы, изучив стартовый город, городской парк и найдя здания полиции и больницу. Не забудь пройтись по магазинам одежды и заглянуть в автосалон." },
            { "Это понятно, а что на счет ролевой игры?\n", "Залог хорошей ролевой игры это продуманный персонаж. Прежде всего постарайся ответить на несколько вопросов: «Сколько лет твоему персонажу?», «Откуда он родом?», «Чего он хочет прямо сейчас?», «Какие его страхи?», «Чем он занимается в мире?». Придумав как бы твой персонаж ответил на эти вопросы, ты сделаешь его гораздо глубже и интереснее. А саму ролевую игру можно начать просто поздоровавшись с другим игроком через текстовый или голосовой чат и предложив, например, съездить вместе в казино и попробовать сорвать куш. Самое главное всегда помнить, что ролевая игра ведется игроком от имени его персонажа." },
            { "От имени персонажа? Можно поподробнее?\n", "На NEXT RP можно встретить игроков разных возрастов, профессий и занятий, из разных городов и даже стран. Но их игровые персонажи могут быть вовсе на них непохожи! Зайдя на NEXT RP студент второго курса медицинского колледжа превращается в старшего лейтенанта Новороссийска. Учительница математики старших классов — в угонщицу автомобилей из преступной группировки. Офисный клерк может играть за бесстрашного полицейского, а вернувшийся с уроков десятиклассник оказаться владельцем городского завода." },
            { "Значит пока я играю от имени персонажа,\n я могу делать все что захочу?\n", "Да, все верно. Но помни, что каждое действие твоего персонажа окажет влияние на его историю и дальнейшую судьбу. Нападение на другого персонажа может закончиться встречей с полицейскими, проникновение на армейские объекты — перестрелкой с военнослужащими, а езда по обочине — штрафом." },
            { "Получается, что играть за злодея нельзя?\n", "Не совсем. Но нарушение закона, нападение на других персонажей и нарушение общественного порядка, приводит к закономерным последствиям. Ограбить персонажа другого игрока, приставив к нему оружие и заставив перевести себе деньги можно, но этот игрок может пойти в полицию и написать заявление на твоего персонажа. А угнав машину скорой помощи, твой персонаж очень скоро обнаружит, что его преследует патруль, намереваясь «похвалить за законопослушное поведение» и «вручить медаль добропорядочного гражданина». Персонаж может быть злым, но игрок может быть хорошим. Плохой игрок, после того как нападет на другого игрока и увидит что его объявили в розыск, уйдет в оффлайн, чтобы избежать наказания. Хороший игрок тоже может напасть на другого игрока, но он будет знать зачем его персонаж это сделал и не будет игнорировать последствия своего поступка." },
            { "Но нельзя постоянно отыгрывать,\nмне вот хочется и просто по карте побегать!\n", "Действительно, постоянно отыгрывать своего персонажа может быть утомительно и иногда хочется сделать перерыв. Но для начала разберемся, как это правильно называется. IC — (англ. in-character) это игровой процесс, строящийся вокруг отыгрыша персонажа. Когда игрок активно участвует в ролевой игре своим персонажем, он находится IC. Отыгрыш и ролевая игра проходят исключительно в IC-режиме. OOC — (англ. out-of-character) это игровой процесс, строящийся вне рамок персонажа. Примером может быть общение между игроками, обсуждения отыгрышей и построение договоренностей, а также отдельные элементы геймплея (некоторые профессии, случайные события, войны преступных группировок). Важно: мы не приветствуем нахождение в ООС-режиме, но до тех пор пока это не мешает другим игрокам, это разрешено." },
            { "А как мне не мешать другим игрокам?\n", "Проще всего сказать: «не портить атмосферу», но давай рассмотрим детальнее чем страшно злоупотребление OOC-режимом на самых популярных примерах." },
            { "Метагейм", "- (англ. metagame) это использование информации, полученной OOC (вне отыгрыша) во время отыгрыша. пример: Васин персонаж — полковник полиции. Вася хорошо общается с Петей, чей персонаж — громила в ОПГ. Петя пишет Васе, что завтра у ОПГ планируется отыгрыш с ограблением казино. Вася заходит в игру и сообщает другим полицейским о том, что завтра бандиты планируют налет. Вася получил информацию в OOC и использовал ее в IC-режиме. Вася сметагеймил, ведь об ограблении знал Вася, а не его персонаж." },
            { "Пауэргейм", "-  (англ. powergame) это преувеличение возможностей персонажа, как физических так и психологических: суперсила, невероятное уклонение, невосприимчивость к боли, желание в одиночку напасть на военную часть, бег со сломанной ногой. Все это является игнорированием законов игрового мира. пример: Персонаж Васи, тот самый полковник полиции, вышел на патруль, забыв оружие. В ходе патрулирования улиц его окликнул персонаж Пети — громила из ОПГ. Персонаж Пети был в пяти метрах от персонажа Васи и был вооружен автоматом. Вася решил задержать его, а не вызывать подкрепление. Вася увидел что Петя начал печатать и не может стрелять, поэтому он быстро подбежал к нему и надел на него наручники. Вася спавергеймил, ведь задержать вооруженного автоматом преступника, особенно когда он в нескольких метрах от тебя, а сам ты без оружия, нельзя." },
            { "Нрп", "- (англ. Non-RP) это нереалистичное поведение персонажа, либо создание нереалистичных ситуаций, в IC-режиме. пример: Вася устал охотиться за преступниками и решил покататься на служебной машине и пострелять в других игроков. Вася занимается нрп, потому что его действия портят атмосферу игры." },
            { "А если я все же буду мешать другим игрокам?\n", "За действия персонажа наказывается персонаж. За действия игрока наказывается игрок. Если твой персонаж, в ходе ролевого отыгрыша, устроит перестрелку на центральной улице, то твоего персонажа попытаются арестовать силы полиции. Если тебе станет скучно и ты начнешь ломать машины других игроков и расстреливать тех кто к тебе подходит, то доступ твоего аккаунта в игру могут приостановить на несколько часов/дней" },
        },
    },

    {
        sName = "Статьи розысков",
        sIcon = "icon_2",
        pContent = {
            { "1.1 Убийство\n", "Умышленное убийство другого игрока.\n30 минут заключения", 1 },
            { "1.2 Нарушение порядка\n", "Нарушение общественного порядка.\n5 минут заключения", 1 },
            { "1.3 Нападение\n", "Нападение на гос.служащего.\n20 минут заключения", 1 },
            { "1.4 Нападение\n", "Нападение на гражданского.\n10 минут заключения", 1 },
            { "1.5 Порча имущества\n", "Умышленная порча частной собственности.\nШтраф 1500 рублей", 1 },
            { "1.6 Порча имущества\n", "Умышленная порча государственной собственности.\n5 минут заключения", 1 },
            { "1.7 Вандализм\n", "Порча общественной собственности (граффити).\n5 минут заключения", 1 },
            { "1.8 Неподчинение\n", "Неподчинение требованиям сотрудника гос.органов при исполнении.\nШтраф 300 рублей", 1 },
            { "1.9 Ношение огнестрельного оружия\n", "Выстрел из огнестрельно оружия\n15 минут заключения", 1 },
            { "1.10 Ложный вызов\n", "Ложный вызов гос.сотрудников\nШтраф 1000 рублей", 1 },
            { "1.11 Неуплата штрафов\n", "Сумма штрафов привысила 60 000 рублей.\n30 минут заключения", 1 },
            { "1.12 Выход из игры во время РП процесса\n", "Вы вышли из игры во время РП процесса\nШтраф 3000 рублей", 1 },
            { "1.13 Хранение запрещенного оружия\n", "Незаконное хранение огнестрельного оружия\nШтраф 10000 рублей", 1 },
            { "1.14 Нападение на инкассацию\n", "Умышленное нанесение ущерба сотрудникам инкассации.\n20 минут заключения", 1 },

            { "2.1 Дорожно-транспортное происшествие\n", "Скрыться с места ДТП.\n15 минут заключения", 1 },
            { "2.2 Неподчинение\n", "Неподчинение сотрудникам госорганов при исполнении.\nШтраф 300 рублей", 1 },
            { "2.3 Езда на поврежденном авто\n", "Езда на дымящимся транспорте.\nШтраф 150 рублей", 1 },
            { "2.4 Помеха движению\n", "Умышленное создание помехи транспортному потоку\nШтраф 1000 рублей", 1 },
            { "2.5 Проезд через двойную сплошную\n", "Умышленый проезд через двойную сплошную\nШтраф 1500 рублей", 1 },
            { "2.6 Езда по тротуарам\n", "Умышленная езда не по проезжей части.\nШтраф 500 рублей", 1 },
            { "2.7 Езда по обочине\n", "Умышленная езда не по проезжей части.\nШтраф 500 рублей", 1 },
            { "2.8 Проезд на красный\n", "Проезд на красный сигнал светофора.\nШтраф 1500 рублей", 1 },
            { "2.9 Превышение скорости\n", "Превышение допустимой скорости, через фото фиксацию.\nШтраф 1000 рублей", 1 },
            { "2.10 Нарушение требований сотрудника ДПС\n", "Нарушение требований сотрудника ДПС.\nШтраф 3000 рублей", 1 },
            { "2.11 Угон транспорта\n", "Угон частного транспорта.\n20 минут заключения", 1 },
            { "2.12 Неуплата штрафов\n", "Сумма штрафов привысила 60 000 рублей.\nКонфискация транспорта", 1 },
            { "2.13 Несоблюдение знаков\n", "Не соблюдение знаков правил дорожного движения.\nШтраф 1000 рублей", 1 },
            { "2.14 Виновник ДТП\n", "Виновник дорожно-транспортного происшествия .\nШтраф 1500 рублей", 1 },
            { "2.15 Езда по встречной полосе\n", "Умышленная езда по встречной полосе движения .\nШтраф 2000 рублей", 1 },
            { "3.1 Побег\n", "Побег из мест заключения.\n15 минут заключения", 1 },
        },
    },

    {
        sName = "Термины",
        sIcon = "icon_3",
        pContent = {
            { "МГ (МетаГейм, Metagame)", "— использование информации, полученной в режиме OOC во время ролевой игры." },
            { "ДМ (ДесМатч, Deathmatch)", "—убийство персонажа другого игрока, совершенное вне режима IC." },
            { "ДМ авто (AutoDeathmatch)", "— уничтожение или нанесение урона чужому транспортному средству вне режима IC." },
            { "ПГ (ПауэрГейминг, Powergaming)", "— превышение физических возможностей персонажа: ездить на крыше транспортного средства, нападать с кулаками на вооруженного персонажа, нападать в одиночку на толпу и т.д." },
            { "СК (Спавн Килл, Убийство на респауне, Spawn Kill)", "— убийство персонажей других игроков в точках респауна, а также в зеленых зонах." },
            { "NRP (НонРП, неролевое поведение)", "— нарушение логики действий персонажа, также нереалистичное поведение персонажа, либо создание нереалистичных ситуаций персонажем, совершенное в IC-режиме." },
            { "NRP-езда (НонРП-езда)", "— управление транспортным средством, невозможное в реальной жизни, или совершенное с нарушением правил дорожного движения во время нахождения персонажа игрока на рабочей смене." },
            { "ЕПП(Езда по полям) и ЕПТ(Езда по тротуарам)", "- передвижение на ТС , используя тротуары/поля." },
            { "RK(RepeatKill)", "- убийство одного и того же игрока в определенный момент времени." },
            { "RK(RevengeKill)", "- возвращение на место  смерти до истечения 15 минут." },
        },
    },

    {
        sName = "Правила сервера",
        sIcon = "icon_4",
        pContent = { },
    },

    {
        sName = "Правила фракций",
        sIcon = "icon_4",
        filter_by_faction = true,
        pContent = { },
    },

    {
        sName = "Правила лидеров",
        sIcon = "icon_4",
        pContent = {
            { "1 Основные", "" },

            { "1.1", " Лидер - это игрок, который является руководителем фракции (государственной организации).\nОн отвечает за наборы сотрудников, контроль их работы и все внутренние процессы, которые имеют отношение к жизни фракции.", 3 },
            { "1.2", " Лидер фракции назначается на должность игровой администрацией сервера путем прохождения собеседования, заявки на пост лидера открываются на форуме, оставить заявку может любой желающий.\nИсключением является “Мэрия” — лидера мэрии \n(мэра) выбирает народ (игроки), путем голосования.", 3 },
            { "1.3", " Каждый лидер имеет заместителей, которые помогают ему в процессах управления фракцией. Все заместители обязаны придерживаться тех же правил, что и лидеры." },
            { "1.4", " Пост лидера может занять игрок, достигший 8-го уровня (на сервере, где планирует стать лидером)." },
            { "1.5", " Количество заместителей варьируется в зависимости от количества участников фракции, таким образом:" },
            { "  *", " Если количество участников фракции меньше или равно 60 - во фракции может быть максимум 2 заместителя;" },
            { "  *", " Если количество участников фракции больше 61 - устанавливается 3-й заместитель.", 2 },

            { "2 Правила", "" },

            { "2.1", " Минимальный срок лидерства составляет 28 дней." },
            { "2.2", " Максимальный срок лидерства составляет 84 дня (3 срока подряд)." },
            { "2.3", " Минимальный онлайн лидера в день составляет 4 часов." },
            { "2.4", " При уходе с поста лидера по собственному желанию, игрок может подать заявку на пост лидера только спустя месяц." },
            { "2.5", " При снятии с поста лидера за нарушения, игрок лишается возможности занять данный пост повторно." },
            { "2.6", " Личные взаимоотношения лидера и других игроков не должны сказываться на игровом процессе." },
            { "2.7", " Минимальный возраст, с которого можно стать лидером фракции - 16 лет." },
            { "2.8", " Лидер осуществляет управление фракцией при помощи куратора (администратора, курирующего фракцию). Любые решения должны обсуждаться с куратором фракции.", 2 },

            { "3 Обязанности лидера", "" },

            { "3.1", " Лидер обязан соблюдать правила сервера." },
            { "3.2", " Лидер и заместители обязаны ежедневно проводить наборы в ряды фракции." },
            { "3.3", " Лидер обязан проводить обучение сотрудников, контролировать их поведение во время смены и пресекать любые нарушения." },
            { "3.4", " Лидер обязан решать любые конфликты между фракциями, в том числе конфликты между сотрудниками и другими игроками." },
            { "3.5", " Лидер обязан иметь DISCORD, во время смены находиться в канале фракций и следить за тем, что сотрудники также находились в нем." },
            { "3.6", " Лидер обязан вести еженедельную отчетность о проделанной работе." },
            { "3.7", " Лидер обязан вести раздел фракции на форуме и в дискорде.", 2 },

            { "4 Запрещено", "" },

            { "4.1", " Запрещено нарушать правила сервера." },
            { "4.2", " Запрещено допускать любые проявления панибратства (блата). За нарушение данного пункта следует блокировка учётной записи по всем серверам NEXTRP." },
            { "4.3", " Запрещено увольнять сотрудников без наличия доказательств нарушения." },
            { "4.4", " Запрещены любые оскорбления игроков / сотрудников фракции за пределами игрового процесса (ООС чаты; Discord лидеров, форум)." },
            { "4.5", " Запрещено препятствовать игровому процессу исходя из личных взаимоотношений c игроками." },
            { "4.6", " Запрещено продавать должности за игровые / реальные средства. За нарушение данного пункта следует блокировка учетной записи по всем серверам NEXTRP." },
            { "4.7", " На период первого срока лидерства, лидеру запрещено подавать заявки на пост хелпера / на пост лидера другого сервера / другой фракции.", 2 },

            { "5 Наказания", "" },

            { "5.1", " Наказание - мера пресечения в сторону лидера фракции в случае нарушения правил или неисполнения обязанностей." },
            { "5.2", " Существует 2 вида наказаний:" },
            { "1)", " Устный выговор: выдается за незначительные проступки, которые не имеют систематический характер. Устный выговор можно снять при помощи баллов, которые выдаются лидеру за проведения глобальных мероприятий между фракциями и хорошую работу;" },
            { "2)", " Письменный выговор: выдается в случае значительных, либо нарушений имеющие систематический характер, как со стороны участников фракции, так и самого лидера." },
            { "5.3", " 3 устных выговора = 1 письменный." },
            { "5.4", " 3 письменных выговора = снятие лидера с должности." },
        },
    },
}

FACTIONS_RULES = {
    [F_ARMY] = {
        { "Армия", "" },
        { "Приказом Министра обороны", "Российской Федерации от «2» декабря 2020 г. №257, каждому военнослужащему строго запрещается:", 1.25 },

        { "•", " Неуважительное отношение к сослуживцам и гражданским лицам. Неуважительным отношением считается: хамство, оскорбления и любые проявления нетолерантного поведения." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Применение огнестрельного оружия/физической силы, без предупреждения и весомой причины. Весомой причиной считается:" },
        { "-", " Угроза жизни и здоровью военнослужащего/окружающим гражданам;" },
        { "-", " Несанкционированное проникновение на территорию В.Ч. (Воинской части);" },
        { "-", " Погоня." },
        { "Наказание:", " увольнение сотрудника, отправка под трибунал и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Несоблюдение субординации/невыполнение приказов старших по званию." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Отдавать приказы, которые противоречат законам Российской Федерации.", 1.25 },

        { "•", " Нарушение законов Российской Федерации или правил сервера." },
        { "Наказание:", " 1 выговор либо увольнение (увольнение в случае грубых нарушений) + наказание предусмотренное законом  УК РФ.", 1.25 },

        { "•", " Использование служебного транспорта для личных целей." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала/Министра обороны)." },
    },
    [F_POLICE_PPS_NSK] = {
        { "ППС", "" },
        { "Приказом Министра внутренних дел", "Российской Федерации от «4» мая 2020 г. №251, каждому сотруднику полиции строго запрещается:", 1.25 },

        { "•", " Ложные/необоснованные обвинения гражданского лица по статьям УК РФ." },
        { "Наказание:", " увольнение сотрудника и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Задержание, и/или заключение гражданского лица без причины." },
        { "Наказание:", " увольнение сотрудника и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Беспричинное обвинение гражданского лица.", 1.25 },

        { "•", " Неуважительное отношение к сослуживцам и гражданским лицам. Неуважительным отношением считается: хамство, оскорбления и любые проявления нетолерантного поведения." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Применение огнестрельного оружия/физической силы, без предупреждения и весомой причины. Весомой причиной считается:" },
        { "-", " Задержание нарушителя. Примечание: задержание должно быть законным! При задержании разрешено использовать “Тайзер”;" },
        { "-", " Оказание сопротивления при задержании;" },
        { "-", " Угроза жизни и здоровью сотрудника полиции/окружающим гражданам;" },
        { "-", " Погоня за нарушителем." },
        { "Наказание:", " увольнение сотрудника, отправка под трибунал и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Несоблюдение субординации/невыполнение приказов старших по званию." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Нарушение законов Российской Федерации или правил сервера." },
        { "Наказание:", " увольнение сотрудника, отправка под трибунал и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Использование служебного транспорта для личных целей." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала/Министра МВД)." },
    },
    [F_POLICE_DPS_NSK] = {
        { "ДПС (УГИБДД)", "" },
        { "Приказом Министра внутренних дел", "Российской Федерации от «1» апреля 2020 г. №251, каждому сотруднику УГИБДД строго запрещается:", 1.25 },

        { "•", " Ложные/необоснованные обвинения гражданского лица по статьям УК РФ." },
        { "Наказание:", " увольнение сотрудника и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Задержание, и/или заключение гражданского лица без причины." },
        { "Наказание:", " увольнение сотрудника и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Беспричинное обвинение гражданского лица.", 1.25 },

        { "•", " Неуважительное отношение к сослуживцам и гражданским лицам. Неуважительным отношением считается: хамство, оскорбления и любые проявления нетолерантного поведения." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Применение огнестрельного оружия/физической силы, без предупреждения и весомой причины. Весомой причиной считается:" },
        { "-", " Задержание нарушителя. Примечание: задержание должно быть законным! При задержании разрешено использовать “Тайзер”;" },
        { "-", " Оказание сопротивления при задержании;" },
        { "-", " Угроза жизни и здоровью сотрудника полиции/окружающим гражданам;" },
        { "-", " Погоня за нарушителем." },
        { "Наказание:", " увольнение сотрудника, отправка под трибунал и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Несоблюдение субординации/невыполнение приказов старших по званию." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала).", 1.25 },

        { "•", " Нарушение законов Российской Федерации или правил сервера." },
        { "Наказание:", " 1 выговор либо увольнение (увольнение в случае грубых нарушений) + наказание предусмотренное законом  УК РФ.", 1.25 },

        { "•", " Использование служебного транспорта для личных целей." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение т.Генерала/Министра МВД)." },
    },
    [F_MEDIC] = {
        { "Медики", "" },
        { "Приказом Министра здравоохранения", "Российской Федерации от «1» апреля 2020 г. №251, каждому медику строго запрещается:", 1.25 },

        { "•", " Неуважительное отношение к сослуживцам и гражданским лицам. Неуважительным отношением считается: хамство, оскорбления и любые проявления нетолерантного поведения!" },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение Главного Врача).", 1.25 },

        { "•", " Отказ пациенту в оказании медицинской помощи." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение Главного Врача).", 1.25 },

        { "•", " Нарушение законов Российской Федерации или правил сервера." },
        { "Наказание:", " 1 выговор либо увольнение (увольнение в случае грубых нарушений) + наказание предусмотренное законом.", 1.25 },

        { "•", " Использование служебного транспорта для личных целей." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение Главного Врача).", 1.25 },
    },
    [F_FSIN] = {
        { "ФСИН", "" },
        { "Приказом Министра юстиции", "Российской Федерации от «3» июля 2020 г. №252, каждому сотруднику ФСИН строго запрещается:", 1.25 },

        { "•", " Ложные/необоснованные обвинения гражданского лица по статьям УК РФ." },
        { "Наказание:", " увольнение сотрудника и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Задержание, и/или заключение гражданского лица без причины." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение директора ФСИН).", 1.25 },

        { "•", " Неуважительное отношение к сослуживцам и гражданским лицам. Неуважительным отношением считается: хамство, оскорбления и любые проявления нетолерантного поведения." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение директора ФСИН).", 1.25 },

        { "•", " Применение огнестрельного оружия/физической силы, без предупреждения и весомой причины. Весомой причиной считается:" },
        { "-", " Задержание нарушителя. Примечание: задержание должно быть законным! При задержании разрешено использовать “Тайзер”;" },
        { "-", " Оказание сопротивления при задержании;" },
        { "-", " Угроза жизни и здоровью сотрудника полиции/окружающим гражданам;" },
        { "-", " Погоня за нарушителем." },
        { "Наказание:", " увольнение сотрудника, отправка под трибунал и наказание в соответствии с законами УК РФ.", 1.25 },

        { "•", " Несоблюдение субординации/невыполнение приказов старших по званию." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение директора ФСИН).", 1.25 },

        { "•", " Нарушение законов Российской Федерации или правил сервера." },
        { "Наказание:", " 1 выговор либо увольнение \n(увольнение в случае грубых нарушений) + наказание предусмотренное законом  УК РФ.", 1.5 },

        { "•", " Использование служебного транспорта для личных целей." },
        { "Наказание:", " 1 выговор, либо увольнение (на усмотрение директора ФСИН/Министра юстиции)." },
    },
}
FACTIONS_RULES[F_POLICE_PPS_GORKI] = FACTIONS_RULES[F_POLICE_PPS_NSK]
FACTIONS_RULES[F_POLICE_PPS_MSK] = FACTIONS_RULES[F_POLICE_PPS_NSK]
FACTIONS_RULES[F_POLICE_DPS_GORKI] = FACTIONS_RULES[F_POLICE_DPS_NSK]
FACTIONS_RULES[F_POLICE_DPS_MSK] = FACTIONS_RULES[F_POLICE_DPS_NSK]
FACTIONS_RULES[F_MEDIC_MSK] = FACTIONS_RULES[F_MEDIC]

RULES = [[
1. ОБЩИЕ ПОЛОЖЕНИЯ|s /b
1.1 NEXTRP|s — это ролевой проект, действия которого происходят в российских городах /b

1.2 Любые отношения|s на NEXTRP выстраиваются исходя из взаимного уважения /b

1.3 Каждый игрок,|s зарегистрированный на проекте,с момента регистрации считается ознакомленным со всеми правилами и несет ответственность за их несоблюдение /b

1.4 Правила действуют|s на всех игроков, независимо от их игрового статуса на проекте /b

1.5 При изменении правил,|s будет оповещение в официальных источниках проекта /b

1.6 Игровая администрация|s NEXTRP действует в рамках правил проекта /b

1.7 Аффилированные учетные записи|s — учетные записи связанные по одному или нескольким признаками /b

1.8 Конечный продукт NEXTRP|s — создание максимально-комфортного игрового процесса, доступного каждому пользователю /b

1.9 Нарушение|s — совершение пользователем действия, запрещенного правилами проекта. Влечет за собой применение наказания к учетной записи пользователя /b

1.10 Повторное нарушение|s — намеренное нарушение правил проекта, совершенное после применения наказания за аналогичное нарушение /b

1.11 Наказание|s — действие по ограничению или прекращению доступа пользователя к проекту NEXTRP или к отдельным его элементам со стороны администрации проекта /b

2.  УЧЕТНЫЕ ЗАПИСИ ПОЛЬЗОВАТЕЛЕЙ|s /b
2.1 Учетные записи пользователей|s — созданные конечным пользователем аккаунты для доступа к сервису NEXTRP /b

2.1.1 Зарегистрированные на NEXTRP|s учетные записи,являются интеллектуальной собственностью компании /b

2.1.2 NEXTRP сохраняет|s за собой исключительные права на все учетные записи пользователей /b

2.2 Политика NEXTRP|s по отношению к учетным записям пользователей /b

2.2.1 Администрация и сотрудники NEXTRP|s никогда не станут запрашивать ваши личные данные, в том числе логины, пароли и прочую информацию об аккаунте. Остерегайтесь мошенников! /b

2.2.2 Администрация не несет ответственности|s за сохранность игрового имущества, а также имущества, закрепленного за игроками. Никому не передавайте данные от Вашего аккаунта, ни под каким предлогом! /b

2.2.3 Администрация не занимается|s восстановлением игрового имущества, в случае взлома или передачи вашей учетной записи третьим лицам. Мы бы с радостью помогли вам в таком случае, но практика показала, что есть множество ребят, которые злоупотребляли отсутствием этого правила! /b

2.2.4 Запрещена покупка, либо продажа|s (попытка продажи) учетных записей NEXTRP /b

Наказание:|s

Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей (как для покупателя, так и для продавца) /b

2.2.5 Пользователям запрещена покупка|s, либо продажа игрового имущества|s и должностей за реальные деньги (намеренная передача игровой валюты через казино, продажу автомобилей, бизнесов, недвижимости и всего прочего — аналогично будет считаться нарушением и попадать под данный пункт правил)

Наказание: |s

Постоянная блокировка действия учетной записи на всех серверах, а также всех аффилированных учетных записей (как для продавца, так и для покупателя) /b

2.2.6 Запрещена намеренная передача|s учетной записи|s третьим лицам /b

Наказание: |s

Временная приостановка действия учетной записи на срок до 7 дней /b

Наказание при повторном нарушении: |s

Повторная приостановка действия учетной записи на срок до 30 дней /b

2.2.7 Запрещено создание|s и использование более 3-х учетных записей|s на одном устройстве /b

Наказание: |s

Постоянная блокировка всех учетных записей, которые были зарегистрированы после первых 3-х /b

2.3 Получение несанкционированного доступа|s к чужой учетной записи.

Запрещены любые действия, совершенные как на игровом сервере, так и вне его, направленные на получение несанкционированного доступа к учетной записи, зарегистрированной другим игроком проекта /b

Наказание: |s

Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей /b

3. ИГРОВЫЕ НИКИ|s /b
3.1 Ники игроков должны|s иметь следующий формат: "Имя Фамилия". (Алексей Шукшин, Елена Кутузова и т.д.) /b

3.2 Запрещено использовать ники|s не являющиеся именем и фамилией.|s (Пруф Кеков, Баттхерт Мемный, Натаха Двеусловки и т.д.) /b

Наказание: |s

Принудительная смена никнейма по выбору пользователя /b

3.3 Запрещено использовать|s оскорбительные и нецензурные ники /b

Наказание: |s

Принудительная смена имени персонажа /b

4. RP-РЕЖИМ|s /b
4.1 Игровой процесс на сервере неотъемлемо|s связан с ролевой игрой, отыгрышем своего персонажа и взаимодействием с персонажами других игроков/b

4.2 OOC (Вне персонажа, Out of character)|s — взаимодействие с другими игроками, происходящее независимо от ролевого процесса, через внешние площадки NEXTRP, специальные игровые чаты или иные способы связи/b

4.3 IC (В режиме ролевой игры, In character)|s — взаимодействие с другими игроками или игровым миром, происходящее непосредственно во время ролевого процесса/b

4.4 MG (метагейминг)|s — использование внеигровой информации (информации из реальной жизни) во время игрового процесса, находясь в игре.

 Для полного погружения в реальность происходящего, в игре запрещено упоминать информацию из реальной жизни. Помните это и старайтесь всегда отыгрывать свою роль :)/b

Наказание: |s

Блокировка текстового и голосового чата на срок от 5 минут до 15 минут/b

4.5 DM (ДесМатч, Deathmatch)|s — убийство или нанесение урона персонажу другого игрока при условии отсутствия весомой на то причины.
Причиной на то, может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни./b
Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут /b

Наказание при повторном нарушении|s (если с момента первого, до второго нарушения прошло менее 30 минут):

 Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут.

 Временная приостановка действия учетной записи сроком на 1 час, при множественных и массовых нарушениях./b

4.6 DB (ДрайвБай)|s — убийство или нанесение урона персонажу другого игрока, находясь на водительском месте транспортного средства, при условии отсутствия весомой на то причины. Причиной может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни./b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

Наказание при повторном нарушении:|s

Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут.

 Временная приостановка действия учетной записи сроком на 1 час (при множественных и массовых нарушениях)/b

4.7 DM auto (AutoDeathmatch)|s — уничтожение или нанесение урона любому транспортному средству при условии отсутствия весомой на то причины.
Причиной на то, может послужить ситуация, которая случилась непосредственно в игре, но не в реальной жизни./b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

Наказание при повторном нарушении:|s

Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут/b

4.7.1 Повреждение чужого транспортного средства|s путем неоднократного столкновения, равно как и умышленное создание ДТП/b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

Наказание при повторном нарушении:|s

Временная приостановка действия учетной записи на срок до 3 часов/b

4.8 PG (ПауэрГейминг, Powergaming)|s — превышение физических возможностей персонажа: ездить на крыше транспортного средства, нападать с кулаками на вооруженного персонажа, нападать в одиночку на толпу и т.д/b

Наказание: |s

Отключение игрока от сервера/b

4.9 SK (Спавн Килл, Убийство на респауне, Spawn Kill)|s — убийство персонажа других игроков в точках респауна/b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

Наказание при повторном нарушении: |s

Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут.

 Временная приостановка действия учетной записи сроком на 1 час (при множественных и массовых нарушениях)/b

4.10 NRP (НонРП, не ролевое поведение)|s — нарушение логики действий персонажа, также не реалистичное поведение персонажа, либо создание не реалистичных ситуаций персонажем, совершенное в IC-режиме/b

Примечание:|s отыгрывание визуально видимых моментов является необязательным в РП процессе (пример: достал оружие; ударил тазером; надел наручники и любые действия, которые отображаются визуально)/b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

Наказание при повторном нарушении:|s

Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут/b

4.11 Читы|s — использование стороннего программного обеспечения, модификаций, хаков, CLEO-скриптов, инъекций в внутриигровой движок игры и т.д., с целью получения преимущества над другими игроками или создания помех/b

Наказание:|s

Перманентная блокировка учетной записи, а также всех аффилированных учетных записей/b

4.12 Создание помех для ролевого процесса|s — вмешательство в ролевой процесс других игроков, совершенный вне IC-режима или с нарушением правил проекта/b

Наказание: |s

Отключение игрока от сервера/b

Наказание при повторном нарушении:|s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

4.13 Абьюз|s — использование любых ошибок, уязвимостей, неучтенных возможностей игрового мода, с целью получения преимущества над другими игроками или создания помех./b

Наказание: |s

Временная приостановка действия учетной записи на срок до 3 дней + удаление игрового имущества, полученного с нарушением данного пункта правил.

 В случае грубых нарушений, которые наносят вред и ущерб продукту NEXTRP: постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей/b

4.14 Срыв мероприятия|s — вмешательство в проводимое администрацией или согласованное игроками проекта с администрацией, меро-
приятие, с целью создания помех РП процессу/b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 5 минут до 15 минут/b

4.15 Запрещено стоять AFK более 5 минут|s /b

Наказание: |s

Отключение игрока от сервера.

 Если игрок находится AFK в месте, где создает помеху для других игроков: администрация вправе переместить игрока в другую локацию, где игрок не создает помеху для других/b

4.16 IC и OOC Обман игроков|s

Запрещен IC обман игроков запрещен на проекте NextRP.

 Выход из игры во время IC обмена приравнивается к OOC обману.

 Все сделки, оговоренные двумя сторонами должны быть выполнены обоюдно, при отсутствии выполнения условий со стороны игрока сделка приравнивается к IC обману/b

Запрещен OOC обман|s

Покупка, либо продажа имущества происходит исключительно с помощью функционала сервера. Обход приравнивается к OOC обману.

 Все договоренности в чатах игры и личных сообщениях дискорда приравниваются к OOC обману/b

Примечание:|s Для доказательств OOC обмана, Вы обязательно должны иметь видеозапись с диалогом/b

Наказание: |s

Удаление игрового имущества, полученного с нарушением данного пункта правил + временная приостановка действия учетной записи на срок до 3 дней/b

Наказание при повторном нарушении:|s

Удаление игрового имущества, полученного с нарушением данного пункта правил + временная приостановка действия учетной записи на срок до 7 дней/b

4.16.1 Возврат имущества|s

Администрация проекта NEXTRP не осуществляет возврат имущества, утерянного пользователем, вследствие неисполнения условий внутриигровой сделки. Данное положение распространяется на всех участников сделки. Старайтесь взвесить все за и против непосредственно перед любой сделкой!/b

4.17 Отказ от РП-ситуации|s

Игрок имеет право отказаться от ситуации только в том случае, если его унижают во время РП процесса. Все остальные отказы от РП-ситуаций считаются нарушением./b

Наказание: |s

Перемещение персонажа в КПЗ на срок от 15 минут до 30 минут./b

5. ЧАТЫ И КАНАЛЫ ОБРАТНОЙ СВЯЗИ|s /b
5.1 Оскорбления|s

Запрещены любые оскорбления игроков в OOC-чат и злоупотребление оскорблениями, неуместными в текущей ролевой ситуации в IC-чат/b

Наказание: |s

Блокировка текстового и голосового чата на срок от 5 минут до 30 минут в зависимости от тяжести оскорблений/b

5.2 Упоминание родных|s

Запрещены любые упоминания и оскорбления родных, как прямым текстом, так и завуалированно/b

Наказание: |s

Блокировка голосового чата от 30 минут до 60 минут.

 Блокировка учетной записи сроком до 3 дней.

 *Наказание выдается в зависимости от тяжести оскорблений/b

5.3 Оскорбления нации|s и разжигания межнационального конфликта.

 Запрещены любые оскорбления нации игроков проекта/b

Наказание: |s

Блокировка голосового чата от 30 минут до 60 минут.

 Блокировка учетной записи сроком до 3 дней/b

*Наказание выдается|s в зависимости от тяжести оскорблений/b

5.4 Запрещено осуществлять рекламу|s любую рекламу сайтов, а также сторонних проектов /b

Наказание: |s

Блокировка текстового и голосового чата на срок от 12 часов до 24 часов, либо  временная приостановка действия учетной записи на срок до 1 дня/b

Наказание при повторном нарушении:|s

Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей/b

5.5 Запрещено повторять|s сообщения более двух раз, а также писать сообщения, лишенные смысловой нагрузки/b

Наказание: |s

Блокировка текстового и голосового чата на срок от 5 минут до 15 минут./b

6. ЗЛОНАМЕРЕННЫЙ ОБМАН|s /b
6.1 Выдача себя за представителя NEXTRP|s

Запрещено сообщать пользователям заведомо-ложную информацию о наличии каких-либо отношений с NEXTRP, равно как и информацию о наличии личных связей с администрацией NEXTRP /b

Наказание: |s

Перманентная блокировка всех учетных записей пользователя /b

6.1.1 Выдача себя за представителя NEXTRP|s, совершенная с целью получения доступа к чужой учетной записи запрещена./b

Наказание: |s

Перманентная блокировка всех учетных записей пользователя /b

6.1.2 Выдача себя за представителя NEXTRP|s, совершенная с целью завладения игрового имущества других пользователей/b

Наказание: |s

Перманентная блокировка всех учетных записей пользователя /b

6.1.3 Запрещена выдача себя|s за представителя NEXTRP, либо за его родственника, совершенная с целью создания токсичной атмосферы/b

Наказание: |s

Временная приостановка действия учетной записи на срок до 3 дней/b

Наказание при повторном нарушении:|s

Временная приостановка действия учетной записи на срок до 7 дней /b

6.2 Злоупотребление каналами обратной связи|s

Запрещена передача заведомо-ложной информации администрации проекта с целью получения преимущества над другими игроками, или применения наказания к учетной записи другого игрока, засорение каналов обратной связи ненужной информацией, которая не является проблемой или вопросом по игре,
 к примеру: "Привет, как дела?"./b

Наказание: |s

Блокировка текстового и голосового чата на срок от 5 минут до 15 минут/b

7. ГРУБЫЕ НАРУШЕНИЯ|s /b
7.1 Грубые нарушения|s — действия пользователей, направленные на причинение ущерба продукту NEXTRP, а также направленные на саботаж деятельности администрации NEXTRP/b

7.2 Администрация NEXTRP|s применяет иные наказания к пользователям, совершившим грубое нарушение, вне зависимости от наличия или отсутствия умысла/b

7.3 Злоупотребление правилами|s — использование не указанных в правилах элементов взаимодействия с игровым миром или другими пользователями, с целью получения значительного преимущества над другими игроками, или создания значительных помех ролевому процессу/b

Наказание: |s

Временная приостановка действия учетной записи на срок до 3 дней/b

Наказание при повторном нарушении:|s

Временная приостановка действия учетной записи на срок до 7 дней/b

7.4 Ущерб серверам|s — любое действие или бездействие, направленное на нанесение значительного вреда экономике игровой валюты или стабильности работы сервера или проекта в целом/b

Наказание: |s

Постоянная блокировка действия учетной записи, а также всех аффилированных учетных записей/b

8. ПЕРЕСМОТР НАКАЗАНИЙ|s /b
8.1 Каждый пользователь,|s считающий, что наказание выданное администрацией игровых серверов несправедливо, имеет возможность оспорить его при помощи сервисов технической поддержки NEXTRP. /b
8.2 Каждый пользователь,|s который обнаружил баг или ошибку игры, обязан сообщить о ней в сервисы технической поддержки./b
8.3 Каждый пользователь,|s сообщивший первым о критических багах, абьюзах или ошибках игрового мода, которые потенциально могут нанести ущерб продукту NEXTRP — получает награду в виде игровой валюты на сервере, где играет (нашел критический баг - сообщил в поддержку - получил награду) 
]]

RULES = string.gsub(RULES, "\n", "")

local tbl1 = split(RULES, "/b")

for k, v in pairs(tbl1) do
    local result = split(v, "|s")
    if not result[2] then
        result[2] = ""
    end
    result[3] = 0
    RULES_LIST[4].pContent[k] = result
end
