AUTO_SCHOOL_QUESTIONS = 
{
	[ LICENSE_TYPE_MOTO ] =
	{
		[ 1 ] = { text = "Можно ли ездить по тротуарам?", list = { "Можно", "Нельзя", "Можно, только ночью" }, correct = 2 };
		[ 2 ] = { text = "Какой пешеходный переход обозначает данная разметка?", list = { "Только регулируемый", "Только нерегулируемый", "Любой" }, correct = 3 };
		[ 3 ] = { text = "В каком месте Вы должны остановиться?", list = { "Перед светофором", "После светофора", "В любом из перечисленных" }, correct = 1 };
		[ 4 ] = { text = "Сколько полос движения имеет проезжая часть данной дороги?", list = { "Одну полосу", "Две полосы", "Три полосы"}, correct = 2 };
		[ 5 ] = { text = "Какие из указанных знаков требуют обязательной остановки?", list = { "Только А", "Только Б", "Только В" }, correct = 2 };
		[ 6 ] = { text = "В каком направлении можно продолжить движение?", list = { "В направлении Б", "В направлениях А и Б", "В любом направлении" }, correct = 1 };
		[ 7 ] = { text = "Правильно ли припарковался водитель?", list = { "Да", "Нет", "Нет правильного ответа" }, correct = 2 };
		[ 8 ] = { text = "Вам необходимо уступить дорогу другим участникам движения:", list = { "Только при повороте налево или развороте", "Только при повороте направо", "В обоих перечисленных случаях" }, correct = 3 };
		[ 9 ] = { text = "Можно ли выполнить такой манёвр?", list = { "Да", "Нет", "Можно, при отсутствии других автомобилей" }, correct = 2 };
		[ 10 ] = { text = "На каком рисунке есть разметка?", list = { "На изображении А", "На изображении Б", "На обоих изображениях" }, correct = 2 };
		[ 11 ] = { text = "Обязаны ли Вы включить указатель при повороте направо?", list = { "Обязаны", "Обязаны только при наличии движущегося сзади транспортного средства", "Не обязаны" }, correct = 1 };
	};

	[ LICENSE_TYPE_AUTO ] =
	{
		[ 1 ] = { text = "Можно ли ездить по тротуарам?", list = { "Можно", "Нельзя", "Можно, только ночью" }, correct = 2 };
		[ 2 ] = { text = "Какой пешеходный переход обозначает данная разметка?", list = { "Только регулируемый", "Только нерегулируемый", "Любой" }, correct = 3 };
		[ 3 ] = { text = "В каком месте Вы должны остановиться?", list = { "Перед светофором", "После светофора", "В любом из перечисленных" }, correct = 1 };
		[ 4 ] = { text = "Сколько полос движения имеет проезжая часть данной дороги?", list = { "Одну полосу", "Две полосы", "Три полосы"}, correct = 2 };
		[ 5 ] = { text = "Какие из указанных знаков требуют обязательной остановки?", list = { "Только А", "Только Б", "Только В" }, correct = 2 };
		[ 6 ] = { text = "В каком направлении можно продолжить движение?", list = { "В направлении Б", "В направлениях А и Б", "В любом направлении" }, correct = 1 };
		[ 7 ] = { text = "Правильно ли припарковался водитель?", list = { "Да", "Нет", "Нет правильного ответа" }, correct = 2 };
		[ 8 ] = { text = "Вам необходимо уступить дорогу другим участникам движения:", list = { "Только при повороте налево или развороте", "Только при повороте направо", "В обоих перечисленных случаях" }, correct = 3 };
		[ 9 ] = { text = "Можно ли выполнить такой манёвр?", list = { "Да", "Нет", "Можно, при отсутствии других автомобилей" }, correct = 2 };
		[ 10 ] = { text = "На каком рисунке есть разметка?", list = { "На изображении А", "На изображении Б", "На обоих изображениях" }, correct = 2 };
	};

	[ LICENSE_TYPE_TRUCK ] =
	{
		[ 1 ] = { text = "На каком рисунке показана главная дорога?", list = { "На изображении А", "На изображении Б", "На изображении В" }, correct = 1 };
		[ 2 ] = { text = "Какой пешеходный переход обозначает данная разметка?", list = { "Только регулируемый", "Только нерегулируемый", "Любой" }, correct = 3 };
		[ 3 ] = { text = "Как можно проехать в этой ситуации?", list = { "Только вариант Б", "Только вариант В", "Любой из трёх вариантов" }, correct = 3 };
		[ 4 ] = { text = "Сколько полос движения имеет проезжая часть данной дороги?", list = { "Одну полосу", "Две полосы", "Три полосы"}, correct = 2 };
		[ 5 ] = { text = "Какие из указанных знаков требуют обязательной остановки?", list = { "Только А", "Только Б", "Только В" }, correct = 2 };
		[ 6 ] = { text = "В каком направлении можно продолжить движение?", list = { "В направлении Б", "В направлениях А и Б", "В любом направлении" }, correct = 1 };
		[ 7 ] = { text = "Правильно ли припарковался водитель?", list = { "Да", "Нет", "Нет правильного ответа" }, correct = 2 };
		[ 8 ] = { text = "Вам необходимо уступить дорогу другим участникам движения:", list = { "Только при повороте налево или развороте", "Только при повороте направо", "В обоих перечисленных случаях" }, correct = 3 };
		[ 9 ] = { text = "Можно ли выполнить такой манёвр?", list = { "Да", "Нет", "Можно, при отсутствии других автомобилей" }, correct = 2 };
		[ 10 ] = { text = "На каком рисунке есть разметка?", list = { "На изображении А", "На изображении Б", "На обоих изображениях" }, correct = 2 };
	};

	[ LICENSE_TYPE_BUS ] =
	{
		[ 1 ] = { text = "Можно ли ездить по тротуарам?", list = { "Можно", "Нельзя", "Можно, только ночью" }, correct = 2 };
		[ 2 ] = { text = "Где должен остановиться автобус?", list = { "А - позади автобуса", "Б - слева от автобуса", "В - за легковым автомобилем" }, correct = 1 };
		[ 3 ] = { text = "В каком месте Вы должны остановиться?", list = { "Перед светофором", "После светофора", "В любом из перечисленных" }, correct = 1 };
		[ 4 ] = { text = "Кому вы должны уступить дорогу при повороте направо?", list = { "Только пешеходу, переходящему по нерегулируемому переходу", "Только пешеходам, переходящим дорогу, на которую вы поворачиваете", "Всем пешеходам"}, correct = 3 };
		[ 5 ] = { text = "Какие из указанных знаков требуют обязательной остановки?", list = { "Только А", "Только Б", "Только В" }, correct = 2 };
		[ 6 ] = { text = "В каком направлении можно продолжить движение?", list = { "В направлении Б", "В направлениях А и Б", "В любом направлении" }, correct = 1 };
		[ 7 ] = { text = "Правильно ли припарковался водитель?", list = { "Да", "Нет", "Нет правильного ответа" }, correct = 2 };
		[ 8 ] = { text = "Вам необходимо уступить дорогу другим участникам движения:", list = { "Только при повороте налево или развороте", "Только при повороте направо", "В обоих перечисленных случаях" }, correct = 3 };
		[ 9 ] = { text = "Можно ли выполнить такой манёвр?", list = { "Да", "Нет", "Можно, при отсутствии других автомобилей" }, correct = 2 };
		[ 10 ] = { text = "На каком рисунке есть разметка?", list = { "На изображении А", "На изображении Б", "На обоих изображениях" }, correct = 2 };
		[ 11 ] = { text = "Где должен остановиться автобус?", list = { "А - перед остановкой", "Б - на остановке", "В - за остановкой" }, correct = 2 };
	};
}

function GetRandomQuestion( license_type, resolved_questions )
    local question = math.random( 1, #AUTO_SCHOOL_QUESTIONS[ license_type ] )
    local resolved = false
    for k, v in pairs( resolved_questions ) do
        if v.general == false and v.id == question then
            resolved = true
            break
        end
    end
    if resolved then
        return GetRandomQuestion( license_type, resolved_questions )
    else
        return { question, false }
	end
end