loadstring( exports.interfacer:extend( "Interfacer" ) )()
Extend( "Globals" )

FOOD_LIST = {
    { name = "Гематоген", calories = 4, cost = 50 },
    { name = "Квас 0,5л", calories = 12, cost = 120 },
    { name = "Чебурек кошачий", calories = 15, cost = 150 },
    { name = "Кисель с ватрушкой", calories = 19, cost = 180 },
    { name = "Молоко с батоном", calories = 22, cost = 220 },
    { name = "Беляш из барашек", calories = 28, cost = 240 },
    { name = "Шаверма", calories = 35, cost = 300 },
    { name = "Ланч с собой", calories = 50, cost = 1250, inventory = true },
}

SHOPS = {
    -- НСК
    { x = 364.29999, y = -1873.1, z = 21 },
    { x = -223.2002, y = -1297.2998, z = 20.8 },
    { x = 201.10001, y = -1840.70001, z = 20.8 },
    { x = -240.90039, y = -1690.59961, z = 21 },
    { x = -910.09998, y = -1831.40002, z = 21.2 },
    { x = 109.8, y = -1841, z = 20.8 },
    { x = -617.711, y = -1920.748, z = 21.334 },
    { x = -479.2002, y = -1774.2002, z = 21.2 },
    { x = 252.2, y = -2131.4, z = 21 },
    { x = -2863.1101, y = 1650.987, z = 14.1205 },
    -- Горки
    { x = 2261.6001, y = -673.25, z = 60.63 },
    { x = 2177.4199, y = -1215.95999, z = 60.68 },
    { x = 1881.3199, y = -526.98999, z = 60.8 },
    { x = 2168.97, y = -1236.88, z = 60.68 },
    { x = 2009.9301, y = -614.23, z = 60.64 },
    { x = 1851.97, y = -721.62, z = 60.71 },
    { x = 2503.03, y = -784.53, z = 60.76 },
    { x = 2304.854, y = -558.93, z = 62.415 },
    -- Армия
    { x = -2335.923, y = -105.849, z = 21.095, interior = 0, dimension = URGENT_MILITARY_DIMENSION },
    { x = -2335.923, y = -105.849, z = 21.095 },
    -- ОП
    { x = 1923.072, y = 1179.989, z = 16.393 },
    { x = 1892.168, y = 913.157, z = 16.241 },
    -- Подмосковье
    { x = 832.419, y = -357.801, z = 6.566 },
    { x = 840.95, y = -198.888, z = 3.631 },
    { x = 836.363, y = -93.984, z = 6.91 },
    { x = 754.105, y = 0.324, z = 6.91 },
    { x = -303.334, y = 447.16, z = 20.923 },
    { x = -152.595, y = 638.204, z = 21.132 },
    { x = -355.205, y = 663.555, z = 21.132 },
    { x = -371.91, y = 561.078, z = 21.132 },
    { x = -600.721, y = 365.503, z = 20.91 },
}

SHOP_INTERIOR = { }

-- Кино на 10 измерений вперед
for i = 1, 10 do
    table.insert( SHOP_INTERIOR, { x = -286.947, y = -369.314, z = 1353.688, interior = 1, dimension = i } )
end

function GetLocations( )
    return SHOPS
end